In [1]:
import pandas as pd

***

# Insertion of Data
***We can insert new cols into dataframes***
***
**insert(col_index,col_name,col_data)**

In [2]:
data=pd.DataFrame({"Name":["Ahmed","Haider","Zahra","Hassan","Hussain"],"Age":[26,25,18,22,24]})

data

      Name  Age
0    Ahmed   26
1   Haider   25
2    Zahra   18
3   Hassan   22
4  Hussain   24

In [3]:
data.insert(1,"Father Name",["Abdullah","Imran","Ahmed","Haider","Ali"])
data

      Name Father Name  Age
0    Ahmed    Abdullah   26
1   Haider       Imran   25
2    Zahra       Ahmed   18
3   Hassan      Haider   22
4  Hussain         Ali   24

***
**Copy of data into new col from existing col**
***

In [4]:
data["Last Name"]=data["Father Name"][2:]
data

      Name Father Name  Age Last Name
0    Ahmed    Abdullah   26       NaN
1   Haider       Imran   25       NaN
2    Zahra       Ahmed   18     Ahmed
3   Hassan      Haider   22    Haider
4  Hussain         Ali   24       Ali

***
# Deletion of Data
***

**Using pop("col_name")**

In [5]:
print(data)
print()
data.pop("Last Name")

print(data)

      Name Father Name  Age Last Name
0    Ahmed    Abdullah   26       NaN
1   Haider       Imran   25       NaN
2    Zahra       Ahmed   18     Ahmed
3   Hassan      Haider   22    Haider
4  Hussain         Ali   24       Ali

      Name Father Name  Age
0    Ahmed    Abdullah   26
1   Haider       Imran   25
2    Zahra       Ahmed   18
3   Hassan      Haider   22
4  Hussain         Ali   24

***
**Using del keyword. (del df_VarName["col_name"])**

In [6]:
del data["Age"]

data

      Name Father Name
0    Ahmed    Abdullah
1   Haider       Imran
2    Zahra       Ahmed
3   Hassan      Haider
4  Hussain         Ali

***